def area(a:float) -> float:
    '''
    Принимает длину стороны квадрата, возвращает его площадь
    
    Имеет следующие параметры:
        -> a:float - Длина стороны квадрата

    Возвращаемое значение:
        -> area:float - Площадь данного квадрата
    '''
    return a * a


def perimeter(a:float) -> float:
    '''
    Принимает длину стороны квадрата, возвращает его периметр
    
    Имеет следующие параметры:
        -> a:float - Длина стороны квадрата

    Возвращаемое значение:
        -> perimeter:float - Периметр данного квадрата
    '''
    return 4 * a